// NumsByWords.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

string langs[] = { "ноль",
  "один",
  "два",
  "три",
  "четыре",
  "пять",
  "шесть",
  "семь",
  "восемь",
  "девять",
  "десять",
  "одиннадцать",
  "двенадцать",
  "тринадцать",
  "четырнадцать",
  "пятнадцать",
  "шестнадцать",
  "семнадцать",
  "восемнадцать",
  "девятнадцать",
  "двадцать",
  "Двадцать один",
  "Двадцать два",
  "Двадцать три",
  "Двадцать четыре",
  "Двадцать пять",
  "Двадцать шесть",
  "Двадцать семь",
  "Двадцать восемь",
  "Двадцать девять",
  "тридцать",
  "тридцать один",
  "тридцать два",
  "тридцать три" ,
  "тридцать четыре",
  "тридцать пять",
  "тридцать шесть",
  "тридцать семь" ,
  "тридцать восемь",
  "тридцать девять",
  "сорок" ,
  "Сорок один",
  "Сорок два",
  "Сорок три",
  "Сорок четыре",
  "Сорок пять",
  "Сорок шесть",
  "Сорок семь",
  "Сорок восемь",
  "Сорок девять",
  "пятьдесят",
  "Пятьдесят один",
  "Пятьдесят два",
  "Пятьдесят три",
  "Пятьдесят четыре",
  "Пятьдесят пять",
  "Пятьдесят шесть",
  "Пятьдесят семь",
  "Пятьдесят восемь",
  "Пятьдесят  девять",
  "шестьдесят" ,
  "Шестьдесят один",
  "Шестьдесят два",
  "Шестьдесят три",
  "Шестьдесят четыре",
  "Шестьдесят пять",
  "Шестьдесят шесть",
  "Шестьдесят семь",
  "Шестьдесят восемь",
  "Шестьдесят девять",
  "семьдесят",
  "Семьдесят один",
  "Семьдесят два",
  "Семьдесят три",
  "Семьдесят четыре",
  "Семьдесят пять",
  "Семьдесят шесть",
  "Семьдесят семь",
  "Семьдесят восемь",
  "Семьдесят девять",
  "восемьдесят",
  "Восемьдесят один",
  "Восемьдесят два",
  "Восемьдесят три",
  "Восемьдесят четыре",
  "Восемьдесят пять",
  "Восемьдесят шесть" ,
  "Восемьдесят семь",
  "Восемьдесят восемь",
  "Восемьдесят девять",
  "девяносто",
  "Девяносто один",
  "Девяносто два",
  "Девяносто три",
  "Девяносто четыре",
  "Девяносто пять",
  "Девяносто шесть",
  "Девяносто семь",
  "Девяносто восемь",
  "девяносто девять" };

int userNum = 0;

int main()
{
    bool isSuccess = false;
    while (!isSuccess)
    {
        setlocale(LC_ALL, "Russian");

        cout << "Введи число от 0 до 99\n";

        if (userNum == NULL) continue;
        if(userNum != )
        if (userNum < 0 || userNum > 99)
        {
            cout << "ты ввёл число не входящее в требуемый диапозон\n";
            continue;
        }

        cin >> userNum;
        cout << "Ты ввёл " << " " << userNum << "\n";
        cout << "Простыми словами это \n" << langs[userNum];
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
